Repository: MurkyYT/CSAuto
Catalog: src/CSAuto/Languages/Strings.*.resx
Languages: he

# menu_debug
source: Debug
he: דיבג

# menu_language
source: Language
he: שפה

# menu_mobile
source: Phone notifications
he: התראות בטלפון

# menu_exit
source: Exit
he: יציאה

# menu_automation
source: Automation
he: אוטומציה

# menu_general
source: General
he: כללי

# menu_options
source: Settings
he: הגדרות

# menu_opendebug
source: Open Debug Window
he: לפתוח את חלון הדיבג

# menu_autocheckforupdates
source: Check for updates on startup
he: בדוק אם קיימים עדכונים בעת ההפעלה

# menu_checkforupdates
source: Check for updates
he: בדוק אם קיימים עדכונים

# menu_enterip
source: Enter IP address
he: הזן כתובת IP

# menu_enabled
source: Enabled
he: מופעל

# menu_autocheckupdates
source: Auto Check For Updates
he: בדיקה אוטומטית של עדכונים

# menu_autospotify
source: Auto Pause/Resume media
he: השהיה או הפעלה אוטומטית של מדיה

# menu_startup
source: Start With Windows
he: התחל עם Windows

# menu_continuespray
source: Continue Spraying
he: המשך ריסוס

# menu_savedebugframes
source: Save Frames
he: שמור תמונות

# menu_savedebuglogs
source: Save Logs
he: שמור לוגים

# menu_autoaccept
source: Auto Accept Match
he: אישור אוטומטי של משחקים

# menu_autobuyarmor
source: Auto Buy Armor
he: קניה אוטומטית של אפוד מגן

# menu_autobuydefuse
source: Auto Buy Defuse Kit
he: קניה אוטומטית של ערכת נטרול

# menu_preferarmor
source: Prefer armor
he: העדפה לאפוד מגן

# menu_autobuy
source: Auto Buy
he: קניה אוטומטית

# menu_autoreload
source: Auto Reload
he: טעינה אוטומטית

# title_update
source: Check for updates (CSAuto)
he: בדיקת עדכונים (CSAuto)

# title_restartneeded
source: Restart app
he: הפעל מחדש את האפליקציה

# title_error
source: Error
he: שגיאה

# inputtitle_mobileip
source: Mobile Phone IP Address
he: כתובת טלפון נייד

# inputtext_mobileip
source: Enter the IP address you see in the app:
he: הזן את כתובת האיי פי שאתה רואה באפליקציה:

# msgbox_latestversion
source: You have the latest version!
he: יש לך את הגרסה האחרונה!

# msgbox_newerversion
source: Found newer verison ({0}) would you like to download it?
he: נמצאה גרסה חדשה יותר ({0}) האם תרצה להוריד אותה?

# msgbox_restartneeded
source: You must restart the program to apply these changes
he: עליך להפעיל מחדש את האפליקציה כדי להחיל שינויים אלה

# error_update
source: Couldn't check for updates. Try again later
he: אירעה שגיאה בעת בדיקת עדכונים. נסה שוב מאוחר יותר

# error_startup
source: An error ocurred '{0}' Try to download the latest version from github, if it didn't help create a bug report with the error log attached.
he: אירעה שגיאה '{0}' נסה להוריד את הגרסה האחרונה מgithub, אם זה לא עזר ליצור דוח באגים עם יומן השגיאות המצורף.

# menu_notifications
source: Notifications
he: הודעות

# menu_acceptednotification
source: Accepted match
he: אישרתי משחק

# menu_mapnotification
source: Loaded on map
he: נטען על המפה

# menu_lobbynotification
source: Loaded in lobby
he: טעון בלובי

# menu_connectednotification
source: Computer connected
he: מחשב מחובר

# menu_crashednotification
source: Game crashed
he: משחק קרס

# server_computeronline
source: Computer {0} ({1}) is online (CSAuto v{2})
he: המחשב {0} ({1}) דלוק (CSAuto v{2})

# server_loadedmap
source: Loaded on map {0} in mode {1}
he: נטען במפה {0} במצב {1}

# server_loadedlobby
source: Loaded in lobby!
he: טעון בלובי!

# server_gamecrash
source: The game crashed!
he: המשחק קרס!

# server_acceptmatch
source: Accepted a match!
he: אישרתי משחק!

# menu_bombnotification
source: Bomb information
he: מידע על הפצצה

# server_timeleft
source: Bomb seconds left:
he: שניות שנותרו לפצצה:

# server_bombexplode
source: The bomb exploded
he: הפצצה התפוצצה

# server_bombdefuse
source: Bomb has been defused
he: פצצה נוטרלה

# exception_steamnotfound
source: Couldn't find Steam Path
he: לא הצלחתי למצוא את מיקום Steam

# exception_nonetworkadapter
source: No network adapters with an IPv4 address in the system!
he: אין מתאמי רשת עם כתובת IPv4 במערכת!

# exception_csgonotfound
source: Couldn't find CS:GO directory
he: לא הצלחתי למצוא את מיקום CS:GO

# menu_entersteamkey
source: Enter Steam Web API Key
he: הזן מפתח Steam Web API

# inputtitle_steamkey
source: Steam Web API Key
he: מפתח Steam Web API

# inputtext_steamkey
source: Please enter your Steam Web API Key
he: הזן מפתח Steam Web API

# menu_lobbycount
source: Show players lobby count
he: הצג כמות שחקנים בלובי

# menu_entertelegramid
source: Enter Telegram Chat ID
he: הזן מזהה צ'אט טלגרם

# inputtitle_telegramid
source: Telegram ID
he: מזהה טלגרם

# inputtext_telegramid
source: Please enter your Telegram chat id, use the faq if you dont know how
he: אנא הזן את מזהה הצ'אט שלך בטלגרם, השתמש בשאלות הנפוצות אם אינך יודע כיצד

# menu_mobileappenabled
source: Mobile App Notifications Enabled
he: התראות לנייד מופעלות

# error_telegrammessage
source: There was an error when sending the Telegram message, make sure your chat id is correct
he: הייתה שגיאה בעת שליחת הודעת הטלגרם, ודא שמזהה הצ'אט שלך נכון

# inputtext_botlinkbutton
source: Bot Link
he: קישור לבוט

# menu_darktheme
source: Dark Theme
he: נושא כהה

# menu_changelog
source: Changelog
he: יומן השינויים

# title_color
source: Color:
he: צבע:

# inputtext_linkbutton
source: Bot Link
he: קישור לבוט

# server_bombplanted
source: Bomb has been planted
he: הוטמנה הפצצה

# title_discordstate
source: State template
he: תבנית מצב

# title_discorddetails
source: Details template
he: תבנית פרטים

# menu_discordlobby
source: Lobby RPC
he: RPC בלובי

# menu_discordingame
source: In Game RPC
he: RPC במשחק

# title_discordrpctemplates
source: Templates:
he: תבניות:

# discord_friendcode
source: {FriendCode} - Your friencode
he: {FriendCode} - קוד החברים שלך

# discord_gamemode
source: {Gamemode} - The current match mode
he: {Gamemode} - מצב נוכחי של המשחק

# discord_map
source: {Map} - The current match map
he: {Map} - המפה הנוכחית של המשחק

# discord_teamscore
source: {TeamScore} - Your team score
he: {TeamScore} - הניקוד של הקבוצה שלך

# discord_myteam
source: {MyTeam} - Your current team
he: {MyTeam} - הקבוצה הנוכחית שלך

# discord_roundstate
source: {RoundState} - Current round state
he: {RoundState} - המצב הנוכחי של הסיבוב

# discord_matchstate
source: {MatchState} - Current match state
he: {MatchState} - המצב הנוכחי של המשחק

# discord_enemyscore
source: {EnemyScore} - Enemy team score
he: {EnemyScore} - הניקוד של הקבוצה היריבה

# discord_enemyteam
source: {EnemyTeam} - Enemy team name
he: {EnemyTeam} - השם של הקבוצה היריבה

# discord_tscore
source: {TScore} - T side score
he: {TScore} - הניקוד של הT's

# discord_ctscore
source: {CTScore} - CT side score
he: {CTScore} - הניקוד של הCT's

# discord_steamid
source: {SteamID} - Your steam id
he: {SteamID} - המזהה Steam שלך

# discord_result
source: Result
he: תוצאה

# discord_restartneeded
source: You may need to restart the app for changes to apply
he: ייתכן שיהיה עליך להפעיל מחדש את האפליקציה כדי להחיל שינויים

# menu_oldautobuy
source: Disable Chat/Console before auto buy
he: לסגור צ'אט / קונסולה לפני קנייה אוטומטית

# inputtext_testmessagetelegram
source: Send test message
he: שלח הודעת בדיקה

# discord_label
source: Button Label
he: תווית כפתור

# discord_url
source: Button Url
he: כתובת אתר של הכפתור

# menu_discordbuttons
source: Discord RPC Buttons
he: כפתורי Discord RPC

# discord_removebutton
source: Remove Button
he: הסר כפתור

# discord_addbutton
source: Add Button
he: הוסף כפתור

# inputtext_label
source: Enter Label
he: הזן תווית

# inputtext_enterlabel
source: Please enter your desired label
he: אנא הכנס את התווית הרצויה

# inputtext_url
source: Enter URL
he: הזן כתובת אתר

# inputtext_enterurl
source: Please enter your desired URL
he: נא להזין את כתובת האתר הרצויה

# error_entervalid
source: Please enter valid inputs
he: נא להזין ערכים חוקיים

# error_max1discord
source: There is a max amount of 1 button (Discord Limitations)
he: יש כמות מקסימלית של כפתור 1 (מגבלות דיסקורד)

# error_appcrashed
source: An unexpected error has accured!, i will open Error_Log.txt, please open an issue on github with the log Attached!
he: אירעה שגיאה בלתי צפויה!, האם תרצה לשלוח דוח התרסקות?

# error_discordselecttemplate
source: Please select a button template
he: אנא בחר תבנית כפתור

# discord_createtemplate
source: Use template
he: השתמש בתבנית

# error_loadcolors
source: Couldn't load colors for button, be aware that auto accept wont work!
he: לא ניתן היה לטעון צבעים עבור הכפתור, שימו לב שאישור אוטומטית לא יעבוד!

# menu_sendacceptbutton
source: Send capture to telegram on accept
he: שלח צילום לטלגרם כאשר משחק אושר

# error_loadchangelog
source: Couldn't load the changelog, please check your internet connection
he: לא ניתן היה לטעון את יומן השינויים, אנא בדוק את חיבור האינטרנט שלך

# title_warning
source: Warning
he: אזהרה

# error_createfiles
source: Can't create files, logs and debug stuff wont be saved
he: לא ניתן ליצור קבצים, יומנים ונתוני דיבג לא יישמרו

# discord_name
source: {Name} - Current player name
he: {Name} - השם של השחקן הנוכחי

# discord_kills
source: {Kills} - Current player kills
he: {Kills} - כמות ההריגות של השחקן הנוכחי

# discord_deaths
source: {Deaths} - Current player deaths
he: {Deaths} - כמות המוות של השחקן הנוכחי

# discord_mvps
source: {MVPS} - Current player mvps
he: {MVPS} - כמות הMVP's של השחקן הנוכחי

# ckbox_oldscreencapture
source: Use old screen capture technique
he: השתמש בטכניקת לכידת מסך ישנה

# menu_launchcs
source: Launch CS2
he: הפעל את CS2

# menu_autoclosecsauto
source: Close CSAuto when exiting CS2
he: סגור את CSAuto בעת יציאה מ-CS2

# error_notimplemented
source: Not implemented yet
he: עדיין לא מיושם

# button_apply
source: Apply
he: החל

# text_enabled
source: Enabled
he: מופעל

# text_itempriority
source: Priority (the lower, the more chance it will be bought)
he: עדיפות (ככל שהוא נמוך יותר, הסיכוי שהוא ייקנה גדול יותר)

# text_selecteditem
source: Selected item:
he: פריט נבחר:

# error_alreadycontainscustom
source: The custom weapon has already been selected
he: הנשק המותאם אישית כבר נבחר

# buyitem_none
source: None
he: אף אחד

# title_success
source: Success!
he: הצלחה!

# file_importsucess
source: Successfully imported file at '{0}'
he: קובץ מיובא בהצלחה ב '{0}'

# file_savesucess
source: Successfully saved file at '{0}'
he: קובץ נשמר בהצלחה ב '{0}'

# menu_open
source: Open
he: לפתוח

# menu_optionsexport
source: Export settings
he: ייצוא הגדרות

# menu_optionsimport
source: Import settings
he: ייבוא הגדרות

# menu_alternativelocations
source: Alternative Locations
he: מיקומים חלופיים

# menu_website
source: Website
he: אתר אינטרנט

# menu_portablemode
source: Portable Mode
he: מצב נייד

# inputtitle_telegramcustomtoken
source: Custom Telegram Bot Token
he: טוקן בוט טלגרם מותאם אישית

# tooltip_telegramcustomtoken
source: Enter here your bot token which will send you messages, if the token is wrong or doesn't exist the app will fallback to the default token
he: הזן כאן את טוקן הבוט שלך שישלח לך הודעות, אם הטוקן שגוי או שאינו קיים האפליקציה תחזור לטוקן ברירת המחדל

# menu_autofocus
source: Try to focus on cs window when game is found
he: נסה להתמקד בחלון cs כאשר המשחק נמצא

# menu_focusback
source: Focus back to original window on accept
he: התמקד בחזרה לחלון המקורי לאחר אישור המשחק

# warning_language
source: The specified language was not found, app fallbacked to using English
he: השפה שצוינה לא נמצאה, האפליקציה חזרה לשימוש באנגלית

# tooltip_github
source: Open the GitHub repository
he: פתח את מאגר GitHub

# tooltip_discord
source: Join the Discord server
he: הצטרף לשרת הדיסקורד

# menu_server
source: Server
he: שרת

# title_serverport
source: Port:
he: פורט:

# title_serverclients
source: Clients:
he: לקוחות:

# ckbox_oldmouseinput
source: Use old mouse input technique
he: השתמש בטכניקת קלט עכבר ישנה

# title_rebuy
source: Rebuy
he: קנייה חוזרת

# menu_about
source: About
he: אודות

# text_description
source: Counter-Strike 2 companion that automates in-game tasks, such as accepting match, buying items and more
he: אפליקציית ליווי לCounter-Strike 2 אשר עושה אוטומציה למשימות במשחק, כגון אישור משחקים, קניית פריטים ועוד

# title_optimization
source: Optimization
he: אופטימיזציה

# msgbox_hdroptimization
source: A display that supports HDR has been found, the current settings are not optimized for HDR displays, do you want to optimize the settings?
he: נמצא צג שתומך ב-HDR, ההגדרות הנוכחיות אינן מותאמות לצגי HDR, האם ברצונך לבצע אופטימיזציה של ההגדרות?

# error_steamrunning
source: Steam is running, please close it and restart the app
he: Steam פועל, אנא סגור אותו והפעל מחדש את האפליקציה

# error_bindlaunchoption
source: Couldn't add 'bind f13 exec csautobindcommandsender.cfg' to launch options, please add it manually
he: לא ניתן להוסיף את '+exec csautobindcommandsender.cfg' לאפשרויות ההשקה, אנא הוסף אותו ידנית
